package net.shopxx.service;

import net.shopxx.entity.Brand;

/**
 * Service接口 - 品牌
 * ============================================================================
 * 版权所有 2008-2010 长沙鼎诚软件有限公司，并保留所有权利。
 * ----------------------------------------------------------------------------
 * 提示：在未取得SHOP++商业授权之前，您不能将本软件应用于商业用途，否则SHOP++将保留追究的权力。
 * ----------------------------------------------------------------------------
 * 官方网站：http://www.shopxx.net
 * ----------------------------------------------------------------------------
 * KEY: SHOPXXB99DB2E7E2EF324F36B462FD6C183267
 * ============================================================================
 */

public interface BrandService extends BaseService<Brand, String> {

}