package net.shopxx.dao;

import net.shopxx.entity.Footer;

/**
 * Dao接口 - 页面底部信息
 * ============================================================================
 * 版权所有 2008-2010 长沙鼎诚软件有限公司，并保留所有权利。
 * ----------------------------------------------------------------------------
 * 提示：在未取得SHOP++商业授权之前，您不能将本软件应用于商业用途，否则SHOP++将保留追究的权力。
 * ----------------------------------------------------------------------------
 * 官方网站：http://www.shopxx.net
 * ----------------------------------------------------------------------------
 * KEY: SHOPXX6FB6866ABE8BB8E7249ABB5DCF4C570F
 * ============================================================================
 */

public interface FooterDao extends BaseDao<Footer, String> {
	
	/**
	 * 获取Footer对象
	 * 
	 * @return Footer对象
	 * 
	 */
	public Footer getFooter();

}
