package net.shopxx.dao;

import net.shopxx.entity.Log;

/**
 * Dao接口 - 日志
 * ============================================================================
 * 版权所有 2008-2010 长沙鼎诚软件有限公司，并保留所有权利。
 * ----------------------------------------------------------------------------
 * 提示：在未取得SHOP++商业授权之前，您不能将本软件应用于商业用途，否则SHOP++将保留追究的权力。
 * ----------------------------------------------------------------------------
 * 官方网站：http://www.shopxx.net
 * ----------------------------------------------------------------------------
 * KEY: SHOPXXF0640ED29F118E8C97B3B48248458ACA
 * ============================================================================
 */

public interface LogDao extends BaseDao<Log, String> {

}
